package liveStudy.Cjenm;

public class Test2 {
//    N자리 이진수 중 1을 K개 포함하면서 3의 배수인 이진수는 모두 몇 개인지 구하려 합니다. 단, N자리 이진수는 0으로 시작하는 경우도 포함합니다.
//
//    예를 들어 N = 3, K = 2인 경우 3자리 이진수는 000, 001, 010, 011, 100, 101, 110, 111로 총 8개입니다. 이 중 1을 2개 포함하는 이진수는 011, 101, 110이며, 이 중 3의 배수인 이진수는 011, 110으로 총 2개입니다.
//
//    자릿수 N과 1의 개수 K가 매개변수로 주어질 때, 주어질 때, N자리 이진수 중 1을 K개 포함하면서 3의 배수인 이진수는 모두 몇 개인지 return하도록 solution 함수를 완성해주세요.
//
//    제한사항
//    N은 1 이상 50 이하인 자연수입니다.
//    K는 1 이상 N 이하인 자연수입니다.
//    입출력 예
//    N	K	result
//3	2	2
//        4	2	4
//        6	3	2
//    입출력 예 설명
//    입출력 예 #1
//
//    문제 설명과 같습니다.
//
//    입출력 예 #2
//
//            1이 2개 포함된 4자리 이진수 중 3의 배수인 이진수는 0011, 0110, 1001, 1100입니다.
//
//    입출력 예 #3
//
//            1이 3개 포함된 6자리 이진수 중 3의 배수인 이진수는 101010, 010101입니다.
}
